---
kind: method
id: M:Autodesk.Revit.DB.OBJImportOptions.#ctor
source: html/4361b352-a496-9da8-aeb8-067551895ea4.htm
---
# Autodesk.Revit.DB.OBJImportOptions.#ctor Method

Constructs a new instance of OBJImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public OBJImportOptions()
```